#include <stdio.h>

int main()
{
    int i, j; // 此时分配int的内存，起始地址2000，3004
    char k;   // 此时分配char的内存，起始地址4000，分配4个字节（连续内存），一个字节8位二进制数

    i = 3;

    int *pi; //*代表定义指针变量，*是取内容，pi为指针变量名，pi存的是地址

    pi = &i; // 指针变量，存放i的地址，指向变量值i，定义后马上指向一个值

    *pi = 5; // 等价于i=15

    int *pn;
    pn = NULL; // NULL是空指针，表示指针不指向任何有效的内存地址
    // 避免对没有初始化的指针变量非法引用，NULL定义在stdio.h中

    int *q, x;
    float *p, y;
    q = &x;
    p = &y; // 地址和指针对应关系的类型要一致，p和q这里是地址

    int a[10], *ip;
    ip = a; // 首地址是a
    // 不能直接将整型量赋到ip

    // 交换指针的指向
    int a1 = 11, a2 = 22, t;
    int *pa1, *pa2, *p2;
    pa1 = &a1;
    pa2 = &a2;

    p2 = pa1;
    pa1 = pa2;
    pa2 = p2; // 与整型交换一样，借助临时指针

    t = *pa1;
    *pa1 = *pa2;
    *pa2 = t; // 直接交换指向的内容!!也就是交换a1 a2！！*pa1==a1,*pa2==a2

    printf("a1=%d,a2=%d\n", a1, a2);

    // pa1 - pa2 = 两个指针间数据个数!!为实际的地址值之差除以sizeof(数据类型)
    printf("pa1 - pa2 = %ld\n", pa1 - pa2); // 结果为-1，说明pa1比pa2小一个整型数据的地址
    // 差不是表面上的地址值之差！

    return 0;
}